In [2]:
import pandas as pd

In [3]:
obj = pd.Series([1,-4, 5, 10, 11])

In [4]:
obj

0     1
1    -4
2     5
3    10
4    11
dtype: int64

In [5]:
obj.values

array([ 1, -4,  5, 10, 11], dtype=int64)

In [6]:
obj.index

RangeIndex(start=0, stop=5, step=1)

In [8]:
obj2 = pd.Series([1,-4, 5, 10, 11],index=['a','b','c','d','e'])

In [9]:
obj2

a     1
b    -4
c     5
d    10
e    11
dtype: int64

In [10]:
obj2.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [11]:
obj2['a']

1

In [12]:
obj2['d']=20

In [13]:
obj2

a     1
b    -4
c     5
d    20
e    11
dtype: int64

In [14]:
obj2[obj2>5]

d    20
e    11
dtype: int64

In [15]:
obj2*2

a     2
b    -8
c    10
d    40
e    22
dtype: int64

In [16]:
'f' in obj2

False

In [17]:
'a' in obj2

True

In [18]:
sddata = {'Ohio':3500,'Illinois':2000,'Texas':1000,'DC':5000}

In [19]:
obj3 = pd.Series(sddata)

In [20]:
obj3

Ohio        3500
Illinois    2000
Texas       1000
DC          5000
dtype: int64

In [21]:
obj3.index

Index(['Ohio', 'Illinois', 'Texas', 'DC'], dtype='object')

In [22]:
states = ['California','Ohio','Illinois','DC']
obj4 = pd.Series(sddata, index=states)

In [23]:
obj4

California       NaN
Ohio          3500.0
Illinois      2000.0
DC            5000.0
dtype: float64

In [24]:
obj4.isna

<bound method Series.isna of California       NaN
Ohio          3500.0
Illinois      2000.0
DC            5000.0
dtype: float64>

In [25]:
obj4.isnull

<bound method Series.isnull of California       NaN
Ohio          3500.0
Illinois      2000.0
DC            5000.0
dtype: float64>

In [26]:
pd.isnull(obj4)

California     True
Ohio          False
Illinois      False
DC            False
dtype: bool

In [27]:
pd.isna(obj4)

California     True
Ohio          False
Illinois      False
DC            False
dtype: bool

In [28]:
obj3+obj4

California        NaN
DC            10000.0
Illinois       4000.0
Ohio           7000.0
Texas             NaN
dtype: float64

In [29]:
obj4.name = 'Crime Count'

In [30]:
obj4.index.name = 'State'

In [31]:
obj4

State
California       NaN
Ohio          3500.0
Illinois      2000.0
DC            5000.0
Name: Crime Count, dtype: float64

In [32]:
obj4.index = ['DC','Ohio','Illinois','California']

In [33]:
obj4

DC               NaN
Ohio          3500.0
Illinois      2000.0
California    5000.0
Name: Crime Count, dtype: float64

In [34]:
data = {'State':['Illinois','Ohio','DC','Iowa','Indiana'],
         'Population':[100000,20000,10000,5000,20000],
       'Year':[2001,2005,2010,2008,2005]}

In [35]:
dobj = pd.DataFrame(data)

In [36]:
dobj

      State  Population  Year
0  Illinois      100000  2001
1      Ohio       20000  2005
2        DC       10000  2010
3      Iowa        5000  2008
4   Indiana       20000  2005

In [37]:
dobj.head()

      State  Population  Year
0  Illinois      100000  2001
1      Ohio       20000  2005
2        DC       10000  2010
3      Iowa        5000  2008
4   Indiana       20000  2005

In [38]:
dobj.tail()

      State  Population  Year
0  Illinois      100000  2001
1      Ohio       20000  2005
2        DC       10000  2010
3      Iowa        5000  2008
4   Indiana       20000  2005

In [39]:
dobj2 = pd.DataFrame(data, columns = ['Year','State','Population','Debt'],
                    index = ['One','Two','Three','Four','Five'])

In [40]:
obj2

a     1
b    -4
c     5
d    20
e    11
dtype: int64

In [41]:
dobj2

       Year     State  Population Debt
One    2001  Illinois      100000  NaN
Two    2005      Ohio       20000  NaN
Three  2010        DC       10000  NaN
Four   2008      Iowa        5000  NaN
Five   2005   Indiana       20000  NaN

In [42]:
obj2.Debt = 15.5

In [43]:
obj2

a     1
b    -4
c     5
d    20
e    11
dtype: int64

In [44]:
dobj2.Debt = 15.5

In [45]:
dobj2

       Year     State  Population  Debt
One    2001  Illinois      100000  15.5
Two    2005      Ohio       20000  15.5
Three  2010        DC       10000  15.5
Four   2008      Iowa        5000  15.5
Five   2005   Indiana       20000  15.5

In [46]:
dobj2.Debt = np.arrang(5)

NameError: name 'np' is not defined

In [47]:
import numpy as np

In [49]:
dobj2.Debt = np.arange(5)

In [50]:
dobj2

       Year     State  Population  Debt
One    2001  Illinois      100000     0
Two    2005      Ohio       20000     1
Three  2010        DC       10000     2
Four   2008      Iowa        5000     3
Five   2005   Indiana       20000     4

In [52]:
dobj2.loc['One'].State = Ohio

NameError: name 'Ohio' is not defined

In [54]:
newstate = pd.Series(data = ['Ohio','Ohio','Iowa','Iowa','Iowa'],index = ['One','Two','Three','Four','Five'] )

In [55]:
dobj2.State = newstate

In [56]:
dobj2

       Year State  Population  Debt
One    2001  Ohio      100000     0
Two    2005  Ohio       20000     1
Three  2010  Iowa       10000     2
Four   2008  Iowa        5000     3
Five   2005  Iowa       20000     4

In [66]:
dobj2.Debt = np.random.randn(5)

In [68]:
dobj2

       Year State  Population      Debt
One    2001  Ohio      100000  0.979862
Two    2005  Ohio       20000  0.823669
Three  2010  Iowa       10000  0.459493
Four   2008  Iowa        5000 -1.272409
Five   2005  Iowa       20000 -0.099431

In [69]:
dobj2['Estern']=dobj2.State == 'Ohio'

In [72]:
dobj2[dobj2.State=='Iowa']

       Year State  Population      Debt  Estern
Three  2010  Iowa       10000  0.459493   False
Four   2008  Iowa        5000 -1.272409   False
Five   2005  Iowa       20000 -0.099431   False

In [75]:
dobj2[dobj2.Population >=10000 && dobj2.State == 'Ohio']

SyntaxError: invalid syntax (<ipython-input-75-4397540f93b1>, line 1)

In [65]:
help(np.random.randn)

Help on built-in function randn:

randn(...) method of mtrand.RandomState instance
    randn(d0, d1, ..., dn)

    Return a sample (or samples) from the "standard normal" distribution.

    If positive, int_like or int-convertible arguments are provided,
    `randn` generates an array of shape ``(d0, d1, ..., dn)``, filled
    with random floats sampled from a univariate "normal" (Gaussian)
    distribution of mean 0 and variance 1 (if any of the :math:`d_i` are
    floats, they are first converted to integers by truncation). A single
    float randomly sampled from the distribution is returned if no
    argument is provided.

    This is a convenience function.  If you want an interface that takes a
    tuple as the first argument, use `numpy.random.standard_normal` instead.

    Parameters
    ----------
    d0, d1, ..., dn : int, optional
        The dimensions of the returned array, should be all positive.
        If no argument is given a single Python float is returned.

    Returns
    -------
    Z : ndarray or float
        A ``(d0, d1, ..., dn)``-shaped array of floating-point samples from
        the standard normal distribution, or a single such float if
        no parameters were supplied.

    See Also
    --------
    standard_normal : Similar, but takes a tuple as its argument.

    Notes
    -----
    For random samples from :math:`N(\mu, \sigma^2)`, use:

    ``sigma * np.random.randn(...) + mu``

    Examples
    --------
    >>> np.random.randn()
    2.1923875335537315 #random

    Two-by-four array of samples from N(3, 6.25):

    >>> 2.5 * np.random.randn(2, 4) + 3
    array([[-4.49401501,  4.00950034, -1.81814867,  7.29718677],  #random
           [ 0.39924804,  4.68456316,  4.99394529,  4.84057254]]) #random